<a href="https://colab.research.google.com/github/nkr1108/AIMLFundamentals/blob/main/2_Pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<span style="color:green;">**Pandas Series 1d labeled array/list holds any datatype (integer, string, float, python objects, etc.).**</span>

In [ ]:
# importing the libraries
import numpy as np
import pandas as pd

<span style="color:green;">**Converting List into Numpy Array - Advantages** </span>
* <span style="color:green;">**Performance** - NumPy arrays are generally faster and more memory-efficient than pandas Series, especially for large datasets and mathematical operations. This is because NumPy is implemented in C and optimized for numerical computations.
* <span style="color:green;">**Homogeneous Data** - lead to more efficient storage and computations when dealing with large arrays of numbers
* <span style="color:green;">**Mathematical Operations** - NumPy provides a rich set of functions optimized for linear algebra, array manipulation, and statistical calculations
</span>

In [ ]:
# creating a list of price of different medicines
med_price_list = [55,25,75,40,90]

# converting the med_price_list to an numpy array
med_price_arr = np.array(med_price_list)
print("numpy array\n",med_price_arr)
print("type of numpy array\n",type(med_price_arr))

numpy array
 [55 25 75 40 90]
type of numpy array
 <class 'numpy.ndarray'>

<span style="color:green;">**Converting List into Pandas Series - Advantages** </span>
* <span style="color:green;">**Labeling** - One of the biggest advantages of a pandas Series is that it can have labeled indices. This allows you to use meaningful labels to index and access data, making it more intuitive for many analytical tasks
* <span style="color:green;">**Mixed Data Types** - Pandas Series can handle mixed data types, which means you can have a combination of integers, floats, strings, etc., within the same Series
* <span style="color:green;">**Missing Data Handling** - Pandas Series have built-in support for handling missing data, which can be quite convenient for data cleaning and analysis

In [ ]:
# converting the list and numpy array into a Pandas Series object
series_list = pd.Series(med_price_list)
series_arr = pd.Series(med_price_arr)

# printing the converted series object
print(series_arr)
print(type(series_list))

0    55
1    25
2    75
3    40
4    90
dtype: int32
<class 'pandas.core.series.Series'>

<span style="color:green;">**Changing the index** </span>

In [ ]:
# changing the index of a series
med_price_list_labeled = pd.Series(med_price_list, index = ['Omeprazole','Azithromycin','Metformin','Ibuprofen','Cetirizine'])
print(med_price_list_labeled)

Omeprazole      55
Azithromycin    25
Metformin       75
Ibuprofen       40
Cetirizine      90
dtype: int64

<span style="color:green;">**Performing mathematical operations on Pandas Series**</span>

In [ ]:
# adding 2.5 to existing prices
med_price_list_labeled_updated = med_price_list_labeled + 9
med_price_list_labeled_updated

Omeprazole      64
Azithromycin    34
Metformin       84
Ibuprofen       49
Cetirizine      99
dtype: int64

* A new price list was released by vendors for each medicine. Let's find the difference between new price and the old price

In [ ]:
new_price_list = [77, 45.5, 100, 50, 80]
new_price_list_labeled = pd.Series(new_price_list, index = ['Omeprazole','Azithromycin','Metformin','Ibuprofen','Cetirizine'])
print(new_price_list_labeled)

Omeprazole       77.0
Azithromycin     45.5
Metformin       100.0
Ibuprofen        50.0
Cetirizine       80.0
dtype: float64

In [ ]:
print('Difference between new price and old price - ')
print(new_price_list_labeled - med_price_list_labeled_updated)

Difference between new price and old price -
Omeprazole      13.0
Azithromycin    11.5
Metformin       16.0
Ibuprofen        1.0
Cetirizine     -19.0
dtype: float64

<span style="color:green;">**Accessing Series**</span>

In [ ]:
operators = ['AT&T', 'Verizon', 'T-Mobile US', 'US Cellular']
revenue = [171.76, 128.29, 68.4, 4.04]

#creating a Series from lists
telecom = pd.Series(revenue, index=operators)
telecom

AT&T           171.76
Verizon        128.29
T-Mobile US     68.40
US Cellular      4.04
dtype: float64

<span style="color:green;">**Accessing Pandas Series using its index**</span>

In [ ]:
# accessing the first element of series
telecom[0]

171.76

In [ ]:
#  accessing firt 3 elements of a series
telecom[:3]

AT&T           171.76
Verizon        128.29
T-Mobile US     68.40
dtype: float64

In [ ]:
# accessing the last two elements of a series
telecom[-2:]

T-Mobile US    68.40
US Cellular     4.04
dtype: float64

In [ ]:
# accessing multiple elements of a series
telecom[[0,2,3]]

AT&T           171.76
T-Mobile US     68.40
US Cellular      4.04
dtype: float64

<span style="color:green;">**Accessing Pandas Series using its labeled index**</span>

In [ ]:
# accessing the revenue of AT&T
telecom['AT&T']

171.76

In [ ]:
#  accessing firt 3 revenues of operators in the series
telecom[:'T-Mobile US']

AT&T           171.76
Verizon        128.29
T-Mobile US     68.40
dtype: float64

In [ ]:
# accessing multiple values
telecom[['AT&T','US Cellular','Verizon']]

AT&T           171.76
US Cellular      4.04
Verizon        128.29
dtype: float64

<span style="color:blue;">**Pandas DataFrame** is a two-dimensional tabular data structure with labeled axes (rows and columns).</span>

<span style="color:blue;">**Creating a Pandas DataFrame using a list and index**</span>

In [ ]:
student = ['Mary', 'Peter', 'Susan', 'Toby', 'Vishal']
df1 = pd.DataFrame(student,columns=['Student'],index=['one','two','three','four','five',])
df1

      Student
one      Mary
two     Peter
three   Susan
four     Toby
five   Vishal

<span style="color:blue;">**Creating a Pandas DataFrame using a list and with default index**</span>

In [ ]:
student = ['Mary', 'Peter', 'Susan', 'Toby', 'Vishal']
df2 = pd.DataFrame(student,columns=['Student'],index=None)
df2

  Student
0    Mary
1   Peter
2   Susan
3    Toby
4  Vishal

<span style="color:blue;">**Creating a Pandas DataFrame using a dictionary**</span>

In [ ]:
# defining another list
grades = ['B-','A+','A-', 'B+', 'C']

# creating the dataframe using a dictionary
df2 = pd.DataFrame({'Student':student,'Grade':grades})
df2

  Student Grade
0    Mary    B-
1   Peter    A+
2   Susan    A-
3    Toby    B+
4  Vishal     C

<span style="color:blue;">**Creating a Pandas DataFrame using Series**</span>

In [ ]:
year = pd.Series([2012,2013,2014,2015,2016,2017,2018])
energy_consumption = pd.Series([2152,2196,2217,2194,2172,2180,2258])

df3 = pd.DataFrame({'Year':year,'Energy_Consumption(Mtoe)':energy_consumption})
df3

   Year  Energy_Consumption(Mtoe)
0  2012                      2152
1  2013                      2196
2  2014                      2217
3  2015                      2194
4  2016                      2172
5  2017                      2180
6  2018                      2258

<span style="color:blue;">**Creating a Pandas DataFrame using random values**</span>

In [ ]:
# we can create a new dataframe using random values
df4 = pd.DataFrame(np.random.randn(5,2),columns = ['Trial 1', 'Trial 2'])
df4

    Trial 1   Trial 2
0 -0.062465 -0.119546
1  0.516404 -0.569411
2  0.451649  0.714920
3 -0.740058  0.328411
4  0.603626 -0.279983

<span style="color:blue;">**Accessing DataFrames**</span>

In [ ]:
# creating the dataframe using dictionary
store_data = pd.DataFrame({'CustomerID': ['CustID00','CustID01','CustID02','CustID03','CustID04']
                           ,'location': ['Chicago', 'Boston', 'Seattle', 'San Francisco', 'Austin']
                           ,'gender': ['M','M','F','M','F']
                           ,'type': ['Electronics','Food&Beverages','Food&Beverages','Medicine','Beauty']
                           ,'quantity':[1,3,4,2,1],'total_bill':[100,75,125,50,80]})
store_data

  CustomerID       location gender            type  quantity  total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M  Food&Beverages         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50
4   CustID04         Austin      F          Beauty         1          80

In [ ]:
store_data[0:4] ## check the syntax, needs a range in square brackets

  CustomerID       location gender            type  quantity  total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M  Food&Beverages         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50

In [ ]:
# accessing first row of the dataframe
store_data[:]

  CustomerID       location gender            type  quantity  total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M  Food&Beverages         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50
4   CustID04         Austin      F          Beauty         1          80

In [ ]:
# accessing first column of the dataframe
store_data['location']

0          Chicago
1           Boston
2          Seattle
3    San Francisco
4           Austin
Name: location, dtype: object

In [ ]:
# accessing rows with the step size of 2
store_data[::2]

  CustomerID location gender            type  quantity  total_bill
0   CustID00  Chicago      M     Electronics         1         100
2   CustID02  Seattle      F  Food&Beverages         4         125
4   CustID04   Austin      F          Beauty         1          80

In [ ]:
# accessing the rows in reverse
store_data[::-2]

  CustomerID location gender            type  quantity  total_bill
4   CustID04   Austin      F          Beauty         1          80
2   CustID02  Seattle      F  Food&Beverages         4         125
0   CustID00  Chicago      M     Electronics         1         100

<span style="color:blue;">**loc method**

* <span style="color:blue;font-weight:bold">loc is a  method to access rows and columns on pandas objects. When using the loc method on a dataframe, we specify which rows and which columns we want by using the following format:

  * **<code style="color:blue">dataframe.loc[row selection, column selection]</code>**

* <span style="color:blue;font-weight:bold">DataFrame.loc[] method is a method that takes **only index labels** and returns row or dataframe if the index label exists in the data frame.</span>

In [ ]:
# accessing first index value using loc method (indexing starts from 0 in python)
store_data.loc[1]

CustomerID          CustID01
location              Boston
gender                     M
type          Food&Beverages
quantity                   3
total_bill                75
Name: 1, dtype: object

<span style="color:blue;">**Accessing selected rows and columns using loc method**

In [ ]:
# accessing 1st and 4th index values along with location and type columns
store_data.loc[[1,4],['location','type']]

  location            type
1   Boston  Food&Beverages
4   Austin          Beauty

<span style="color:blue;">**iloc method**

* <span style="color:blue;font-weight:bold">The iloc indexer for Pandas Dataframe is used for **integer location-based** indexing/selection by position. When using the loc method on a dataframe, we specify which rows and which columns we want by using the following format:

  * **<code style="color:blue;font-weight:bold">dataframe.iloc[row selection, column selection]</code>**

In [ ]:
# accessing selected rows and columns using iloc method
store_data.iloc[[1,4],[0,2]]

  CustomerID gender
1   CustID01      M
4   CustID04      F

**<span style="color:red;">Difference between loc and iloc indexing methods</span>**

* <b><span style="color:red;">loc is label-based, which means that you have to specify rows and columns based on their row and column labels</span>
* <b><span style="color:red;">iloc is integer position-based, so you have to specify rows and columns by their integer position values (0-based integer position)</span>
    
**<span style="color:red;">If we use labels instead of index values in .iloc it will throw an error.**

In [ ]:
# accessing selected rows and columns using iloc method
store_data.iloc[[1,4],[0,2]]

  CustomerID gender
1   CustID01      M
4   CustID04      F

In [ ]:
# accessing selected rows and columns using iloc method
store_data.iloc[1:4,0:2]

  CustomerID       location
1   CustID01         Boston
2   CustID02        Seattle
3   CustID03  San Francisco

<span style="color:blue;font-weight:bold">We can modify entries of a dataframe using loc or iloc too

In [ ]:
print(store_data.loc[4,'type'])
store_data.loc[4,'type'] = 'Electronics'

Beauty

In [ ]:
store_data

  CustomerID       location gender            type  quantity  total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M  Food&Beverages         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50
4   CustID04         Austin      F     Electronics         1          80

In [ ]:
store_data.iloc[4,3] = 'Beauty'
store_data

  CustomerID       location gender            type  quantity  total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M  Food&Beverages         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50
4   CustID04         Austin      F          Beauty         1          80

<span style="color:blue;font-weight:bold">Condition based indexing</span>

In [ ]:
store_data['quantity']>1

0    False
1     True
2     True
3     True
4    False
Name: quantity, dtype: bool

In [ ]:
store_data.loc[store_data['quantity']>1]

  CustomerID       location gender            type  quantity  total_bill
1   CustID01         Boston      M  Food&Beverages         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50

<span style="color:blue;font-weight:bold">Column addition and removal from a Pandas DataFrame</span>

<span style="color:blue;font-weight:bold">Adding a new column in a DataFrame</span>

In [ ]:
# adding a new column in data frame store_data which is a rating (out of 5) given by customer based on their shopping experience
store_data['rating'] = [2,5,3,4,4]
store_data

,CustomerID,location,gender,type,quantity,total_bill,rating
0,CustID00,Chicago,M,Electronics,1,100,2
1,CustID01,Boston,M,Food&Beverages,3,75,5
2,CustID02,Seattle,F,Food&Beverages,4,125,3
3,CustID03,San Francisco,M,Medicine,2,50,4
4,CustID04,Austin,F,Beauty,1,80,4

<span style="color:blue;font-weight:bold">Removing a column from a DataFrame</span>

In [ ]:
store_data.drop('CustomerID',axis=1,inplace=True) # with inplace
store_data

        location gender            type  quantity  total_bill  rating
0        Chicago      M     Electronics         1         100       2
1         Boston      M  Food&Beverages         3          75       5
2        Seattle      F  Food&Beverages         4         125       3
3  San Francisco      M        Medicine         2          50       4
4         Austin      F          Beauty         1          80       4

In [ ]:
# we can also remove multiple columns simultaneously
# it is always a good idea to store the new/updated data frames in new variables to avoid changes to the existing data frame

# creating a copy of the existing data frame
new_store_data = store_data.copy()
store_data

        location gender            type  quantity  total_bill  rating
0        Chicago      M     Electronics         1         100       2
1         Boston      M  Food&Beverages         3          75       5
2        Seattle      F  Food&Beverages         4         125       3
3  San Francisco      M        Medicine         2          50       4
4         Austin      F          Beauty         1          80       4

In [ ]:
# dropping location and rating columns simultaneously
new_store_data.drop(['location','rating'],axis=1,inplace=True)
new_store_data

  gender            type  quantity  total_bill
0      M     Electronics         1         100
1      M  Food&Beverages         3          75
2      F  Food&Beverages         4         125
3      M        Medicine         2          50
4      F          Beauty         1          80

In [ ]:
# lets check if store_data was impacted
store_data

        location gender            type  quantity  total_bill  rating
0        Chicago      M     Electronics         1         100       2
1         Boston      M  Food&Beverages         3          75       5
2        Seattle      F  Food&Beverages         4         125       3
3  San Francisco      M        Medicine         2          50       4
4         Austin      F          Beauty         1          80       4

* There were no changes to data frame store_data.

<span style="color:blue;font-weight:bold">Removing rows from a dataframe</span>

In [ ]:
store_data.drop(1,axis=0) # notice axis = 0 for rows, again without inplace

        location gender            type  quantity  total_bill  rating
0        Chicago      M     Electronics         1         100       2
2        Seattle      F  Food&Beverages         4         125       3
3  San Francisco      M        Medicine         2          50       4
4         Austin      F          Beauty         1          80       4

In [ ]:
store_data

        location gender            type  quantity  total_bill  rating
0        Chicago      M     Electronics         1         100       2
1         Boston      M  Food&Beverages         3          75       5
2        Seattle      F  Food&Beverages         4         125       3
3  San Francisco      M        Medicine         2          50       4
4         Austin      F          Beauty         1          80       4

* Notice that we used **`axis=0`** to drop a row from a data frame, while we were using **`axis=1`** for dropping a column from the data frame.
* Also, to make permanent changes to the data frame we will have to use `inplace=True` parameter.
* We also see that the index are not correct now as first row has been removed. So, we will have to reset the index of the data frame. Let's see how this can be done.

In [ ]:
# creating a new dataframe
store_data_new  = store_data.drop(1,axis=0)
store_data_new

        location gender            type  quantity  total_bill  rating
0        Chicago      M     Electronics         1         100       2
2        Seattle      F  Food&Beverages         4         125       3
3  San Francisco      M        Medicine         2          50       4
4         Austin      F          Beauty         1          80       4

In [ ]:
# resetting the index of data frame
store_data_new.reset_index()

   index       location gender            type  quantity  total_bill  rating
0      0        Chicago      M     Electronics         1         100       2
1      2        Seattle      F  Food&Beverages         4         125       3
2      3  San Francisco      M        Medicine         2          50       4
3      4         Austin      F          Beauty         1          80       4

* We see that the index of the data frame is now resetted but the index has become a column in the data frame. We do not need the index to become a column so we can simply set the parameter **`drop=True`** in reset_index() function.

In [ ]:
# setting inplace = True to make the changes permanent
store_data_new.reset_index(drop=True,inplace=True)
store_data_new

        location gender            type  quantity  total_bill  rating
0        Chicago      M     Electronics         1         100       2
1        Seattle      F  Food&Beverages         4         125       3
2  San Francisco      M        Medicine         2          50       4
3         Austin      F          Beauty         1          80       4

<span style="color:brown;font-weight:bold">Pandas - Combining DataFrames</span>

In [ ]:
data_cust = pd.DataFrame({"customerID":['101','102','103','104'],
                        'category': ['Medium','Medium','High','Low'],
                        'first_visit': ['yes','no','yes','yes'],
                        'sales': [123,52,214,663]},index=[0,1,2,3])

data_cust_new = pd.DataFrame({"customerID":['101','103','104','105'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [ ]:
data_cust

  customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663

In [ ]:
data_cust_new

  customerID  distance  sales
4        101        12    123
5        103         9    214
6        104        44    663
7        105        21    331

<span style="color:brown;font-weight:bold">Pandas - Combining DataFrames - concat on row</span>

In [ ]:
pd.concat([data_cust,data_cust_new],axis=0)

  customerID category first_visit  sales  distance
0        101   Medium         yes    123       NaN
1        102   Medium          no     52       NaN
2        103     High         yes    214       NaN
3        104      Low         yes    663       NaN
4        101      NaN         NaN    123      12.0
5        103      NaN         NaN    214       9.0
6        104      NaN         NaN    663      44.0
7        105      NaN         NaN    331      21.0

<span style="color:brown;font-weight:bold">Pandas - Combining DataFrames - concat on column</span>

In [ ]:
pd.concat([data_cust,data_cust_new],axis=1)

  customerID category first_visit  sales customerID  distance  sales
0        101   Medium         yes  123.0        NaN       NaN    NaN
1        102   Medium          no   52.0        NaN       NaN    NaN
2        103     High         yes  214.0        NaN       NaN    NaN
3        104      Low         yes  663.0        NaN       NaN    NaN
4        NaN      NaN         NaN    NaN        101      12.0  123.0
5        NaN      NaN         NaN    NaN        103       9.0  214.0
6        NaN      NaN         NaN    NaN        104      44.0  663.0
7        NaN      NaN         NaN    NaN        105      21.0  331.0

<span style="color:brown;font-weight:bold">Merge - Merge combines dataframes using a column's values to identify common entries</span>

In [ ]:
pd.merge(data_cust,data_cust_new,how='outer',on='customerID') # outer merge is union of on

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes    123.0      12.0    123.0
1        102   Medium          no     52.0       NaN      NaN
2        103     High         yes    214.0       9.0    214.0
3        104      Low         yes    663.0      44.0    663.0
4        105      NaN         NaN      NaN      21.0    331.0

In [ ]:
pd.merge(data_cust,data_cust_new,how='inner',on='customerID') # inner merge is intersection of on

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes      123        12      123
1        103     High         yes      214         9      214
2        104      Low         yes      663        44      663

In [ ]:
pd.merge(data_cust,data_cust_new,how='right',on='customerID')

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes    123.0        12      123
1        103     High         yes    214.0         9      214
2        104      Low         yes    663.0        44      663
3        105      NaN         NaN      NaN        21      331

In [ ]:
data_quarters = pd.DataFrame({'Q1': [101,102,103],
                              'Q2': [201,202,203]},
                               index=['I0','I1','I2'])

data_quarters_new = pd.DataFrame({'Q3': [301,302,303],
                                  'Q4': [401,402,403]},
                               index=['I0','I2','I3'])

In [ ]:
data_quarters

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

In [ ]:
data_quarters_new

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

<span style="color:brown;font-weight:bold">Join behaves just like merge, except instead of using the values of one of the columns to combine data frames, it uses the index labels</span>

In [ ]:
data_quarters.join(data_quarters_new,how='right') # outer, inner, left, and right work the same as merge

       Q1     Q2   Q3   Q4
I0  101.0  201.0  301  401
I2  103.0  203.0  302  402
I3    NaN    NaN  303  403

<span style="color:purple;font-weight:bold">Pandas - Saving and Loading DataFrames

In [ ]:
data=pd.read_csv("StockData.csv")

In [ ]:
# head() function helps us to see the first 5 rows of the data
data.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

<span style="color:purple;font-weight:bold">Loading an excel file in Python

In [ ]:
#data_excel = pd.read_excel(path_excel)

<span style="color:purple;font-weight:bold">Saving the file as csv</span>

In [ ]:
data.to_csv('Saved_StockData.csv',index=False)

<span style="color:purple;font-weight:bold">Saving the dataset as an excel spreadsheet

<span style="color:purple;font-weight:bold"><code>data.to_excel('name of the file.xlsx',index=False)</code>

In [ ]:
data.to_excel('Saved_StockData.xlsx',index=False)

In [ ]:
data.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [ ]:
data.tail()

     stock        date  price
5031   ZTS  01-02-2018  77.82
5032   ZTS  02-02-2018  76.78
5033   ZTS  05-02-2018  73.83
5034   ZTS  06-02-2018  73.27
5035   ZTS  07-02-2018  73.86

In [ ]:
data.shape

(5036, 3)

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   object
 2   price   5036 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.2+ KB

<span style="color:purple;font-weight:bold">min() - to check the minimum value of a numeric column

In [ ]:
data['price'].min()

28.4

<span style="color:purple;font-weight:bold">max() - to check the maximum value of a numeric column**

In [ ]:
data['price'].max()

179.26

<span style="color:purple;font-weight:bold">unique() - to check the number of unique values that are present in a column

In [ ]:
data['stock'].unique()

array(['AAPL', 'SNI', 'TJX', 'ZTS'], dtype=object)

<span style="color:purple;font-weight:bold">value_counts() - to check the number of values that each unique quantity has in a column

In [ ]:
data['stock'].value_counts()

AAPL    1259
SNI     1259
TJX     1259
ZTS     1259
Name: stock, dtype: int64

<span style="color:purple;font-weight:bold">value_counts(normalize=True) - using the `normalize` parameter and initializing it to True will return the relative frequencies of the unique values

In [ ]:
data['stock'].value_counts(normalize=True)

AAPL    0.25
SNI     0.25
TJX     0.25
ZTS     0.25
Name: stock, dtype: float64

<span style="color:purple;font-weight:bold">mean() - to check the mean (average) value of the column

In [ ]:
data['price'].mean()

73.05702966640199

<span style="color:purple;font-weight:bold">median() - to check the median value of the column

In [ ]:
data['price'].median()

69.08500000000001

<span style="color:purple;font-weight:bold">mode() - to check the mode value of the column

In [ ]:
data['stock'].mode()

0    AAPL
1     SNI
2     TJX
3     ZTS
Name: stock, dtype: object

<span style="color:purple;font-weight:bold">To access a particular mode when the dataset has more than 1 mode

In [ ]:
#to access the first mode
data['price'].mode()[0]

74.59

<span style="color:blueviolet;font-weight:bold">Group By function - Pandas DataFrame.groupby() function is used to split the data into groups based on some criteria.

In [ ]:
data.groupby(['stock'])['price'].mean()

stock
AAPL    109.066698
SNI      71.319206
TJX      66.743566
ZTS      45.098648
Name: price, dtype: float64

In [ ]:
# similarly we can get the median price of each stock
data.groupby(['stock'])['price'].median()

stock
AAPL    109.01
SNI      72.31
TJX      68.85
ZTS      45.62
Name: price, dtype: float64

<span style="color:blueviolet;font-weight:bold">Let's create a function to increase the price of the stock by 10%

In [ ]:
def profit(s):
    return s + s*0.10 # increase of 10%

<span style="color:blueviolet;font-weight:bold">The Pandas apply() function lets you to manipulate columns and rows in a DataFrame

In [ ]:
data['price'].apply(profit)

0       74.63962
1       75.41754
2       73.52708
3       73.38716
4       73.32116
          ...
5031    85.60200
5032    84.45800
5033    81.21300
5034    80.59700
5035    81.24600
Name: price, Length: 5036, dtype: float64

In [ ]:
data['new_price'] =data['price'].apply(profit)
data.head()

  stock        date    price  new_price
0  AAPL  08-02-2013  67.8542   74.63962
1  AAPL  11-02-2013  68.5614   75.41754
2  AAPL  12-02-2013  66.8428   73.52708
3  AAPL  13-02-2013  66.7156   73.38716
4  AAPL  14-02-2013  66.6556   73.32116

<span style="color:blueviolet;font-weight:bold">Pandas sort_values() function sorts a data frame in ascending or descending order of passed column

In [ ]:
data.sort_values(by='new_price',ascending=False) # by default ascending is set to True

     stock        date   price  new_price
1244  AAPL  18-01-2018  179.26    197.186
1243  AAPL  17-01-2018  179.10    197.010
1245  AAPL  19-01-2018  178.46    196.306
1241  AAPL  12-01-2018  177.09    194.799
1247  AAPL  23-01-2018  177.04    194.744
...    ...         ...     ...        ...
4076   ZTS  17-04-2014   28.60     31.460
4074   ZTS  15-04-2014   28.55     31.405
4075   ZTS  16-04-2014   28.53     31.383
4073   ZTS  14-04-2014   28.48     31.328
4072   ZTS  11-04-2014   28.40     31.240

[5036 rows x 4 columns]

<span style="color:deeppink;font-weight:bold">Pandas - Date-time Functions

In [ ]:
# checking the first 5 rows of the dataset
data.head()

  stock        date    price  new_price
0  AAPL  08-02-2013  67.8542   74.63962
1  AAPL  11-02-2013  68.5614   75.41754
2  AAPL  12-02-2013  66.8428   73.52708
3  AAPL  13-02-2013  66.7156   73.38716
4  AAPL  14-02-2013  66.6556   73.32116

In [ ]:
# checking the data type of columns in the dataset
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   stock      5036 non-null   object
 1   date       5036 non-null   object
 2   price      5036 non-null   float64
 3   new_price  5036 non-null   float64
dtypes: float64(2), object(2)
memory usage: 157.5+ KB

* We observe that the date column is of object type whereas it should be of date time data type.

In [ ]:
# converting the date column to datetime format
data['date']  = pd.to_datetime(data['date'],dayfirst=True)

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   stock      5036 non-null   object
 1   date       5036 non-null   datetime64[ns]
 2   price      5036 non-null   float64
 3   new_price  5036 non-null   float64
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 157.5+ KB

* We observe that the date column has been converted to datetime format

In [ ]:
data.head()

  stock       date    price  new_price
0  AAPL 2013-02-08  67.8542   74.63962
1  AAPL 2013-02-11  68.5614   75.41754
2  AAPL 2013-02-12  66.8428   73.52708
3  AAPL 2013-02-13  66.7156   73.38716
4  AAPL 2013-02-14  66.6556   73.32116

<span style="color:deeppink;font-weight:bold">The column 'date' is now in datetime format. Now we can change the format of the date to any other format

In [ ]:
data['date'].dt.strftime('%m/%d/%Y')

0       02/08/2013
1       02/11/2013
2       02/12/2013
3       02/13/2013
4       02/14/2013
           ...
5031    02/01/2018
5032    02/02/2018
5033    02/05/2018
5034    02/06/2018
5035    02/07/2018
Name: date, Length: 5036, dtype: object

In [ ]:
data['date'].dt.strftime('%m-%d-%y')

0       02-08-13
1       02-11-13
2       02-12-13
3       02-13-13
4       02-14-13
          ...
5031    02-01-18
5032    02-02-18
5033    02-05-18
5034    02-06-18
5035    02-07-18
Name: date, Length: 5036, dtype: object

<span style="color:deeppink;font-weight:bold">Extracting year from the date column

In [ ]:
data['date'].dt.year

0       2013
1       2013
2       2013
3       2013
4       2013
        ...
5031    2018
5032    2018
5033    2018
5034    2018
5035    2018
Name: date, Length: 5036, dtype: int64

Creating a new column and adding the extracted year values into the dataframe.

In [ ]:
data['year'] = data['date'].dt.year

<span style="color:deeppink;font-weight:bold">Extracting month from the date column

In [ ]:
data['date'].dt.month

0       2
1       2
2       2
3       2
4       2
       ..
5031    2
5032    2
5033    2
5034    2
5035    2
Name: date, Length: 5036, dtype: int64

Creating a new column and adding the extracted month values into the dataframe.

In [ ]:
data['month'] = data['date'].dt.month

<span style="color:deeppink;font-weight:bold">Extracting day from the date column

In [ ]:
data['date'].dt.day

0        8
1       11
2       12
3       13
4       14
        ..
5031     1
5032     2
5033     5
5034     6
5035     7
Name: date, Length: 5036, dtype: int64

Creating a new column and adding the extracted day values into the dataframe.

In [ ]:
data['day'] = data['date'].dt.day

In [ ]:
data.head()

  stock       date    price  new_price  year  month  day
0  AAPL 2013-02-08  67.8542   74.63962  2013      2    8
1  AAPL 2013-02-11  68.5614   75.41754  2013      2   11
2  AAPL 2013-02-12  66.8428   73.52708  2013      2   12
3  AAPL 2013-02-13  66.7156   73.38716  2013      2   13
4  AAPL 2013-02-14  66.6556   73.32116  2013      2   14

* We can see that year, month, and day columns have been added in the dataset.

In [ ]:
# The datetime format is convenient for many tasks!
data['date'][1]-data['date'][0]

Timedelta('3 days 00:00:00')